user1 = input("سنگ و کاغذ و قیچی: ")
user2 = input("سنگ و کاغذ و قیچی: ")
if user1 == user2:
    print("مساوی")
elif user1 == "سنگ":
    if user2 == "کاغذ":
        print("کاربر1 سنگ را انتخاب کرده و کاربر 2 کاغذ را اتخاب کرده \nپس کاربر 2 برنده شده")
    else:
        print("کاربر 1 سنگ را انتخاب کرده و کاربر 2 قیچی را انتخاب کرده \nکاربر 1 برنده شده")
elif user1 == "کاغذ":
    if user2 == "قیچی":
        print("کاربر1 کاغذ را انتخاب کرده و کاربر 2 قیچی را اتخاب کرده \nپس کاربر 2 برنده شده")
    else:
        print("کاربر1 کاغذ را انتخاب کرده و کاربر 2 سنگ را اتخاب کرده \nپس کاربر 1 برنده شده")
elif user1 == "قیچی":
    if user2 == "کاغذ":
        print("کاربر1 قیچی را انتخاب کرده و کاربر 2 کاغذ را اتخاب کرده \nپس کاربر 1 برنده شده")
    else:
        print("کاربر1 قیچی را انتخاب کرده و کاربر 2 سنگ را اتخاب کرده \nپس کاربر 2 برنده شده")